In [1]:
import pandas as pd
course_name = ['Data Science', 'Machine Learning', 'Big Data', 'Data Engineer']
duration = [2,3,6,4]
df = pd.DataFrame(data = {'course_name' : course_name, 'duration' : duration})

### 1)

In [2]:
df.iloc[1:2]

        course_name  duration
1  Machine Learning         3

### 2)

* The loc() function is label based data selecting method which means that we have to pass the name of the row or column which    we want to select

* The iloc() function is an indexed-based selecting method which means that we have to pass an integer index in the method to s   select a specific row/column.

### 3)

In [3]:
reindex = [3,0,1,2]

In [4]:
new_df = df.reindex(reindex)

In [5]:
new_df

        course_name  duration
3     Data Engineer         4
0      Data Science         2
1  Machine Learning         3
2          Big Data         6

In [6]:
new_df.loc[2]

course_name    Big Data
duration              6
Name: 2, dtype: object

In [7]:
new_df.iloc[2]

course_name    Machine Learning
duration                      3
Name: 1, dtype: object

* There is difference in both output because loc takes the named indexes whereas iloc takes the default indexes

### 4)

In [8]:
import pandas as pd
import numpy as np
columns = ['column_1', 'column_2', 'column_3', 'column_4', 'column_5', 'column_6']
indices = [1,2,3,4,5,6]
#Creating a dataframe:
df1 = pd.DataFrame(np.random.rand(6,6), columns = columns, index = indices)

In [9]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.645301  0.237679  0.066364  0.956967  0.400167  0.668480
2  0.106016  0.948825  0.388863  0.771467  0.539098  0.203087
3  0.609124  0.527103  0.981614  0.465634  0.765090  0.122264
4  0.642857  0.411971  0.018911  0.663375  0.448087  0.732634
5  0.152332  0.676410  0.555345  0.874527  0.129060  0.068687
6  0.788387  0.616942  0.480438  0.231074  0.796725  0.058076

* (i) mean of each and every column present in the dataframe.

In [10]:
df1.describe()

       column_1  column_2  column_3  column_4  column_5  column_6
count  6.000000  6.000000  6.000000  6.000000  6.000000  6.000000
mean   0.490669  0.569822  0.415256  0.660507  0.513038  0.308871
std    0.287113  0.242605  0.353312  0.271441  0.248630  0.308380
min    0.106016  0.237679  0.018911  0.231074  0.129060  0.058076
25%    0.266530  0.440754  0.146988  0.515069  0.412147  0.082081
50%    0.625990  0.572023  0.434651  0.717421  0.493592  0.162675
75%    0.644690  0.661543  0.536618  0.848762  0.708592  0.552132
max    0.788387  0.948825  0.981614  0.956967  0.796725  0.732634

* standard deviation of column, ‘column_2’

In [11]:
df1['column_2'].std()

0.2426048477416068

### 5)

In [12]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.645301  0.237679  0.066364  0.956967  0.400167  0.668480
2  0.106016  0.948825  0.388863  0.771467  0.539098  0.203087
3  0.609124  0.527103  0.981614  0.465634  0.765090  0.122264
4  0.642857  0.411971  0.018911  0.663375  0.448087  0.732634
5  0.152332  0.676410  0.555345  0.874527  0.129060  0.068687
6  0.788387  0.616942  0.480438  0.231074  0.796725  0.058076

In [13]:
df1.loc[[2],["column_2"]]= "ok"

In [14]:
df1

   column_1  column_2  column_3  column_4  column_5  column_6
1  0.645301  0.237679  0.066364  0.956967  0.400167  0.668480
2  0.106016        ok  0.388863  0.771467  0.539098  0.203087
3  0.609124  0.527103  0.981614  0.465634  0.765090  0.122264
4  0.642857  0.411971  0.018911  0.663375  0.448087  0.732634
5  0.152332   0.67641  0.555345  0.874527  0.129060  0.068687
6  0.788387  0.616942  0.480438  0.231074  0.796725  0.058076

In [15]:
#df1['column_2'].mean()

The abovewill cause error has occured because mean only requires numerical data however we are providing mixture
of numerical and string data

### 6)

* Windows function are the function that helps to perform calculation within a given time range such as 
  window of 2 days , 3 days etc.
* rolling() is one such windows function

### 7)

In [16]:
date = pd.to_datetime("2023-02-28")

In [17]:
date

Timestamp('2023-02-28 00:00:00')

In [18]:
date.month

2

In [19]:
date.year

2023

### 8)

In [24]:
def date_diffrence(x,y):
    x = pd.to_datetime(x)
    y= pd.to_datetime(y)
    diff = pd.Timedelta(y-x)
    print ("Difference in days are: ",diff.components[0])
    print("Difference in hours are : ",diff.components[1])
    print("Difference in minutes are: ",diff.components[2])

In [25]:
#Enter this date 2021/10/20 09:15:32.36980
date1 = input("Enter First date ")

Enter First date  2021/10/20 09:15:32.36980

In [28]:
#Enter this date 2022/2/20 04:25:42.120450"
date2 = input("Enter Second  date ")

Enter Second  date  2022/2/20 04:25:42.120450

In [29]:
date_diffrence(date1,date2)

Difference in days are:  122
Difference in hours are :  19
Difference in minutes are:  10

### 9)